tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet       { $:calculated.nut; }
    outlet      { $:calculated.nut; }
    movingWalls { $:wall.nut; }
    staticWalls { $movingWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
